#include <iostream>
#include <Manufact_module.h>

using namespace std;

int main() {

    setlocale(LC_ALL, "Russian");       // Установка русского языка для вывода

    /** Основные параметры проекта **/
        const size_t PrCount = 9;       // Количество периодов проекта
        const string Cur = "RUR";       // Домашняя валюта проекта

    /** Продукт **/
        const string Name_00 = "Фрикасе из курицы с зеленым горошком";
        const string Meas_00 = "шт.";

    /** План отгрузок готовой продукции **/

    const strItem PPlan[PrCount] {  {0, 0, 0},  {5003, 0, 0},  {8482, 0, 0},
                                {11825, 0, 0}, {15137, 0, 0}, {18428, 0, 0 },
                                {21706, 0, 0}, {24975, 0, 0}, {28239, 0, 0}};

    /** Исходные данные для рецептуры продукта **/
        const size_t rcount_00  = 9;    // Число наименований ресурсов
        const size_t duratio_00 = 1;    // Длительность производственного цикла

        const strNameMeas rnames_00[rcount_00]  // Номенклатура ресурсов
            {{"Горошек зеленый с/м", "кг."}, {"Итальянские травы", "кг."},
             {"Курица бедро", "кг."}, {"Молоко", "кг."},\
             {"Морковь", "кг."}, {"Мука пшеничная", "кг."}, {"Соль", "кг."},
             {"Упаковка", "шт."}, {"Чеснок", "кг."}};

        const decimal recipe_00[rcount_00*duratio_00]  {0.1200, // Рецептура
                                                        0.0012,
                                                        0.2700,
                                                        0.1200,
                                                        0.1320,
                                                        0.0120,
                                                        0.0042,
                                                        1.0000,
                                                        0.0024 };
    /** Создаем рецептуру продукта **/
    clsRecipeItem* rcp_00 =
        new clsRecipeItem(Name_00, Meas_00, duratio_00, rcount_00,
        rnames_00, recipe_00);

    /** Создаем единичное производство **/
    clsManufactItem* man_00 = new clsManufactItem(PrCount, move(*rcp_00));
    man_00->SetProductPlan(PPlan);  // Вводим план отгрузок готовой продукции
    man_00->CalcRawMatPurchPlan();  // Рассчитываем план потребления ресурсов

    /** Отдаем на склад ресурсов план потребления сырья и материалов (например, так:
    const decimal* RMPlan = man_00->GetRawMatPurchPlan()), и получаем от склада данные
    о себестоимости необходимых нам ресурсов. Например, склад вернул нам следующий массив: **/
    const decimal RMRpice[rcount_00*PrCount] {
     100.00,  101.00,  102.01,  103.03,  104.06,  105.10,  106.15,  107.21,  108.28,
    4062.50, 4103.13, 4144.16, 4185.60, 4227.45, 4269.73, 4312.43, 4355.55, 4399.11,
     225.00,  227.25,  229.52,  231.82,  234.14,  236.48,  238.84,  241.23,  243.64,
      39.00,   39.39,   39.78,   40.18,   40.58,   40.99,   41.40,   41.81,   42.23,
      15.00,   15.15,   15.30,   15.45,   15.61,   15.77,   15.92,   16.08,   16.24,
      41.00,   41.41,   41.82,   42.24,   42.66,   43.09,   43.52,   43.96,   44.40,
      19.00,   19.19,   19.38,   19.58,   19.77,   19.97,   20.17,   20.37,   20.57,
      20.00,   20.20,   20.40,   20.61,   20.81,   21.02,   21.23,   21.44,   21.66,
     105.00,  106.05,  107.11,  108.18,  109.26,  110.36,  111.46,  112.57,  113.70};
    if(man_00->SetRawMatPrice(RMRpice));    // Вводим цены ресурсов в производство

    /** Рассчитываем учетную себестоимость готовой продукции **/
    if(!man_00->CalculateItem()) cout << "Ошибка расчета" << endl;
    /** Выводим на экран информаицю о готовом продукте и незавершенном производстве **/
    man_00->ViewCalculate(Cur);                 //

    delete rcp_00;
    delete man_00;
    return 0;
}
